In [5]:
import pandas as pd
import numpy as np

In [6]:
df1 = pd.DataFrame({'k1': ['a', 'a', 'b', 'b', 'a'],
                  'k2': ['One', 'Two', 'One', 'Two', 'One'],
                  'd1': np.random.randn(5),
                  'd2': np.random.randn(5)})

In [7]:
df1

  k1   k2        d1        d2
0  a  One  0.053458 -0.252503
1  a  Two  0.174579 -0.301884
2  b  One  0.868278 -1.402996
3  b  Two -0.764426 -0.726844
4  a  One  0.194300  0.482469

In [8]:
g1 = df1['d1'].groupby(df1['k1'])

In [9]:
type(g1)

pandas.core.groupby.groupby.SeriesGroupBy

In [10]:
g1

In [11]:
print(g1)

<pandas.core.groupby.groupby.SeriesGroupBy object at 0x0EE842F0>

In [12]:
g1.mean()

k1
a    0.140779
b    0.051926
Name: d1, dtype: float64

In [13]:
g1.max()

k1
a    0.194300
b    0.868278
Name: d1, dtype: float64

In [14]:
g1.min()

k1
a    0.053458
b   -0.764426
Name: d1, dtype: float64

In [18]:
g2 = df1['d1'].groupby([df1['k1'], df1['k2']])

In [19]:
g2

In [20]:
g2.mean()

k1  k2
a   One    0.123879
    Two    0.174579
b   One    0.868278
    Two   -0.764426
Name: d1, dtype: float64

In [21]:
df1.groupby([df1['k1'], df1['k2']])['d1'].mean()

k1  k2
a   One    0.123879
    Two    0.174579
b   One    0.868278
    Two   -0.764426
Name: d1, dtype: float64

In [22]:
df1.groupby([df1['k1'], df1['k2']])['d1'].max()

k1  k2
a   One    0.194300
    Two    0.174579
b   One    0.868278
    Two   -0.764426
Name: d1, dtype: float64

In [23]:
df1.groupby([df1['k1'], df1['k2']])['d1'].min()

k1  k2
a   One    0.053458
    Two    0.174579
b   One    0.868278
    Two   -0.764426
Name: d1, dtype: float64

In [24]:
df1.groupby(['k1', 'k2'])['d1'].min()

k1  k2
a   One    0.053458
    Two    0.174579
b   One    0.868278
    Two   -0.764426
Name: d1, dtype: float64

In [25]:
df1

  k1   k2        d1        d2
0  a  One  0.053458 -0.252503
1  a  Two  0.174579 -0.301884
2  b  One  0.868278 -1.402996
3  b  Two -0.764426 -0.726844
4  a  One  0.194300  0.482469

In [26]:
df1.groupby('k1').count()

    k2  d1  d2
k1
a    3   3   3
b    2   2   2

In [27]:
df1.groupby('k1').sum()

          d1        d2
k1
a   0.422336 -0.071919
b   0.103852 -2.129841

In [28]:
df1.groupby('k1').mean()

          d1        d2
k1
a   0.140779 -0.023973
b   0.051926 -1.064920

In [29]:
df1.groupby('k1').median()

          d1        d2
k1
a   0.174579 -0.252503
b   0.051926 -1.064920

In [30]:
df1.groupby('k1').std()

          d1        d2
k1
a   0.076262  0.439286
b   1.154496  0.478112

In [31]:
df1.groupby('k1').var()

          d1        d2
k1
a   0.005816  0.192972
b   1.332861  0.228591

In [32]:
df1.groupby('k1').min()

     k2        d1        d2
k1
a   One  0.053458 -0.301884
b   One -0.764426 -1.402996

In [33]:
df1.groupby('k1').max()

     k2        d1        d2
k1
a   Two  0.194300  0.482469
b   Two  0.868278 -0.726844

In [34]:
df1.groupby('k1').prod()

          d1        d2
k1
a   0.001813  0.036777
b  -0.663734  1.019760

In [35]:
df1.groupby('k1').first()

     k2        d1        d2
k1
a   One  0.053458 -0.252503
b   One  0.868278 -1.402996

In [36]:
df1.groupby('k1').last()

     k2        d1        d2
k1
a   One  0.194300  0.482469
b   Two -0.764426 -0.726844